<?php

namespace Sergeich5\Helpers;

function number2text(int $n): string
{
    if ($n == 0) return 'ноль';
    if ($n < 0) return 'минус ' . number2text(abs($n));

    $orders = [
        1 => ['тысяча', 'тысячи', 'тысяч'],
        2 => ['миллион', 'миллиона', 'миллионов'],
        3 => ['миллиард', 'миллиарда', 'миллиардов'],
    ];

    $r = [];
    $str = str_split(strrev((string)$n), 3);
    foreach ($str as $k => $v) {
        $n = intval(strrev($v));
        $s = __part_number2text($n, $k != 1);

        if ($s != '') {
            if (isset($orders[$k]))
                $s .= ' ' . number($n, $orders[$k]);

            $r[] = trim($s);
        }
    }

    $r = array_reverse($r);

    return trim(implode(' ', $r));
}

function __part_number2text(int $n, bool $male = true): string
{
    $numbers = [
        1 => $male ? 'один' : 'одна',
        2 => $male ? 'два' : 'две',
        3 => 'три',
        4 => 'четыре',
        5 => 'пять',
        6 => 'шесть',
        7 => 'семь',
        8 => 'восемь',
        9 => 'девять',
        10 => 'десять',
        11 => 'одиннадцать',
        12 => 'двенадцать',
        13 => 'тринадцать',
        14 => 'четырнадцать',
        15 => 'пятнадцать',
        16 => 'шестнадцать',
        17 => 'семнадцать',
        18 => 'восемнадцать',
        19 => 'девятнадцать',
    ];

    $decades = [
        2 => 'двадцать',
        3 => 'тридцать',
        4 => 'сорок',
        5 => 'пятьдесят',
        6 => 'шестьдесят',
        7 => 'семьдесят',
        8 => 'восемьдесят',
        9 => 'девяносто',
    ];

    $hundreds = [
        1 => 'сто',
        2 => 'двести',
        3 => 'триста',
        4 => 'четыреста',
        5 => 'пятьсот',
        6 => 'шестьсот',
        7 => 'семьсот',
        8 => 'восемьсот',
        9 => 'девятьсот',
    ];

    $s = ($hundreds[intdiv($n, 100)] ?? '') . ' ';
    $n = $n % 100;

    if (isset($decades[intdiv($n, 10)])) {
        $s .= ($decades[intdiv($n, 10)] ?? '') . ' ';
        $n = $n % 10;
    }

    $s .= ($numbers[$n] ?? '') . ' ';

    return trim($s);
}
